
# Переменных (Тип переменной задаеться автоматически)
name = 'Alex'

x = 5

y = 3 + x

c = y * y

# Типы данных: 

# int
a = 1

# float
a = 3.14

#bool 
a = True

#str
a = 'Привет'




# snake case(Слова разделяються _ нижним пробелом) сумма_продаж_за_три_месяца
# В имени переменной может быть только латиница(a-z, A-Z, _), так же цифры только не в начале
sum_sales_of_3M = 3


# = -> оператор присвоения, == -> оператор сравнения

print(x,'+',y,'=',x+y)

print(name * 3)

print('Привет ' + ' мир !')

# Type cast

a = 155

print(a / 2)

print(int(a) / 2)

